# TriangulationInterfaceForTriangulatedSolidOrShell Properties

---
The TriangulationInterfaceForTriangulatedSolidOrShell type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from TriangulationInterface)
Top
#### Reference
TriangulationInterfaceForTriangulatedSolidOrShell Class
Autodesk.Revit.DB Namespace